#include<stdio.h>
#include<math.h>
int main(){

int n;

int m;

printf("Введите значения для создание матрицы размерности N*M: \n");

printf("N: ");

scanf("%i", &n);

printf("M: ");

scanf("%i", &m);

double matrix[n][m]; //создание матрицы N*M

printf("Заполните матрицу элементами Aij\n");

for(int i=0; i<n; i=i+1){ //заполнение матрицы по iм строкам
	for(int j=0; j<m; j=j+1){ //заполнение матрицы по jм столбцам
		 printf("A%i%i: ", i+1, j+1);
		scanf("%lf", &matrix[i][j]);
	}
}

//выполнение задания
double s = 0.0;
for (int i = 0; i < n; i=i+1){
s = s + exp((double)matrix[i][2]) * ((double)matrix[i][2]/matrix[3][2]); //индыксы на 1 меньше ведь в матрице первый элемент 00, изменение делимого на дабл чтобы сохранить хвосты
}

int max_i = 0;
int max_j = 0;
//ищем максимальный элемент и подменяем его суммой
int max = matrix[0][0];
for(int i=0; i<n; i=i+1){
        for(int j=0; j<m; j=j+1){ 
                 if (matrix[i][j]>max){
		max = matrix[i][j]; //записываем элемент если он больше предыдущего
		max_i = i;//если нашли то записываем координаты в матрице
		max_j = j;
		}
        }
}

matrix[max_i][max_j] = s; //тк i и j из цикла не сохраняются как надо, используем последние записанные максимумы и заменяем на сумму
//вывод матрицы

printf("Матрица с заменой максимального элемента на S: \n");

for (int i = 0; i < n; i=i+1){
	for (int j = 0; j < m; j=j+1){
	printf("%15.2lf  ", matrix[i][j]); //4d выделяет на элемент 4 символа, чтобы не съезжало
	}
printf("\n"); //чтобы все в одну строчку не печаталось
}

printf("Сумма S: %lf\n", s);

}
